---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.SpaceResolutionOutOfRange
source: html/01abdb4e-e919-6d6e-94b9-8f66390e145c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.SpaceResolutionOutOfRange Property

Voxel size is out of range.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpaceResolutionOutOfRange { get; }
```